<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Region;
use Illuminate\Database\Seeder;

class RegionAndCitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $regions = [
            [
                'name' => 'منطقة الرياض',
                'cities' => ['الأفلاج.', 'حوطة بني تميم.', 'ثادق.', 'الحريق.', 'الخرج.', 'حريملاء.', 'الدرعية.', 'رماح.', 'الدوادمي.', 'السليل.', 'الزلفي.', 'ضرما.', 'شقراء.', 'القويعية.', 'المجمعة.', 'وادي الدواسر.', 'العيينة والجبيلة.', 'مرات.', 'الخاصرة.', 'عفيف.', 'الغاط.', 'المزاحمية.', 'الحائر.', 'بنبان- هيت.', 'عرقة.']
            ],
            [
                'name' => 'منطقة مكة المكرمة',
                'cities' => ['مكة المكرمة', 'جدة', 'الطائف', 'رابغ', 'الكامل', 'القنفذة', 'تربة', 'الليث', 'الجموم', 'خليص', 'أضم', 'الخرمة', 'رنية', 'العرضيات', 'الموية', 'ميسان', 'بحرة',]
            ],
            [
                'name' => 'منطقة المدينة المنورة',
                'cities' => [' ينبع', ' بدر', ' العلا', ' الحناكية', ' مهد الذهب', ' خيبر', ' العيص', ' وادي الفرع', 'مغيراء', 'الفريش', 'أبيار الماشي', 'وادي الفرع', 'اليتمة', 'الحنـــو', 'الصويدرة', 'الأكحل', 'أبوضباع', 'المليليح', 'البوير', 'المندسة', 'شجوى', 'الثمد', 'الصلصلة', 'العرايد', 'العشاش', 'سليلة جهينة', 'الشقرة', 'ضاعا',]
            ],
            [
                'name' => 'منطقة القصيم',
                'cities' => ['بريدة  .', 'عنيزة  .', 'الرس  .', 'المذنب  .', 'البكيرية  .', 'البدائع  .', 'الأسياح  .', 'النبهانية  .', 'عيون الجواء  .', 'رياض الخبراء  .', 'الشماسية  .', 'عقلة الصقور  .', 'ضرية  .',]
            ],
            [
                'name' => 'منطقة الشرقية',
                'cities' => ['الدمام ', 'الاحساء ', 'حفر الباطن', 'الجبيل ', 'القطيف  ', 'الخبر', ' الخفجي ', 'رأس تنوره ', 'بقيق ', 'النعيريه ', ' العليا ', 'العديد',]
            ],
            [
                'name' => 'منطقة عسير',
                'cities' => ['أبها', 'خميس مشيط', 'بيشة', 'النماص', 'أحد رفيدة', 'بارق', 'البرك', 'بلقرن', 'تثليث', 'تنومة', 'رجال ألمع', 'الحرجة', 'سراة عبيدة', 'طريب', 'ظهران الجنوب', 'محايل عسير', 'المجاردة',]
            ],
            [
                'name' => 'منطقة تبوك',
                'cities' => [' تيماء ', ' ضباء ', ' الوجه ', ' حقل ', ' أملج ', 'البدع',]
            ],
            [
                'name' => 'منطقة حائل',
                'cities' => ['مدينة حائل', ' بقعاء', ' قفار', ' الغزالة', ' الشنان.', ' موقق.', ' الحائط.', ' السليمي.', ' الشملي.', ' سميراء.', ' الحليفة.', ' جبة.',]
            ],
            [
                'name' => 'منطقة الحدود الشمالية',
                'cities' => ['عرعر', 'رفحاء ', 'طريف', 'العويقيلة ', 'جديدة عرعر', 'شعبة نصاب ', 'روضة ابن هباس', 'المركوز', 'لوقة', 'ابن شريم', 'الجبهان', 'لينة', 'الخشيبي', 'أم الضيان', 'أم خنصر', 'هجرة الديدب', 'السليمانية', 'هجرة ابن سعيد', 'هجرة ابن بكر', 'ابن عايش', 'طلعة التمياط', 'الحدقة', 'هجرة قليب بن غنيم', 'هجرة أم رضمة', 'الدويد', 'زبالا', 'السلمانية', 'الأدية', 'ال علي', 'الدويد', 'نعيجان', 'العجرمية', 'ال علي', 'الدويد', 'دغيليب الوجعان', 'أعيوج لينة', 'رغوه', 'ابن عجل', 'الكاسب', 'كمب الثنيان', 'زهوة', 'الركعا',]
            ],
            [
                'name' => 'منطقة جازان',
                'cities' => ['صبيا	', 'صامطة	', 'أبو عريش	', 'جازان	', 'أحد المسارحة', 'بيش	', 'العارضة	', 'ضمد	', 'الدرب	', 'العيدابي	', 'الدائر	', 'الريث	', 'الحرث	', 'الطوال	', 'فيفاء',]
            ],
            [
                'name' => 'منطقة نجران',
                'cities' => ['نجران ', 'شرورة.', 'الحصينية. ', 'حبونا.', 'ثار.', 'يدمه.', 'بدر الجنوب.', 'خباش.', 'الخرخير.',]
            ],
            [
                'name' => 'منطقة الباحة',
                'cities' => ['بني حسن', 'غامد الزناد	', 'المندق	', 'المخواة	', 'العقيق	', 'قلوة	', 'القرى	', 'بني حسن	', 'الحجرة	', 'بلجرشي	',]
            ],
            [
                'name' => 'منطقة الجوف',
                'cities' => ['سكاكا', ' القريات', ' دومة الجندل', ' طبرجل',]
            ],
        ];

        foreach ($regions as $region) {
            $regionRecord = Region::create(['name' => $region['name']]);
            foreach ($region['cities'] as $city) {
                City::create([
                    'name' => $city,
                    'region_id' => $regionRecord->id,
                ]);
            }
        }
    }
}
