<template>
	<div
		class="py-16 px-8 min-h-screen bg-gray-100 flex items-center justify-center"
	>
		<teleport to="head">
			<title>خدمة توصيل | كراسة الاشتراطات</title>
		</teleport>
		<div class="w-full">
			<div
				class="max-w-screen-xl mx-auto lg:max-w-screen-lg md:max-w-screen-md sm:max-w-screen-sm"
			>
				<transition
					mode="out-in"
					enter-active-class="transition duration-500 ease-in transform"
					leave-active-class="transition duration-500 ease-out transform"
					enter-from-class="opacity-0 translate-x-10"
					enter-to-class="opacity-1 translate-x-0"
					leave-from-class="opacity-1 translate-x-0"
					leave-to-class="opacity-0 translate-x-10"
				>
					<div v-if="$page.props.auth.user.conditions_accepted_at">
						<h1 class="my-3 text-3xl">مرحبا بك</h1>
						<p class="text-gray-700 mb-3">تم اكمال جميع الخطوات</p>

						<div class="shadow bg-white w-full">
							<div class="py-4 px-8">
								<p class="mb-4">
									يمكنك الان البدء في استخدام موقعنا ،، حظا
									موفقا.
								</p>
								<Link :href="route('home')">
									العودة للصفحة الرئيسية
								</Link>
							</div>
						</div>
					</div>
					<div v-else>
						<h1 class="my-3 text-3xl">كراسة الاشتراطات</h1>
						<p class="text-gray-700 mb-3">
							لمتابعة استخدام الموقع يجب الموافقة على شروط
							الاستخدام
						</p>
						<div class="shadow bg-white w-full">
							<form @submit.prevent="accept">
								<div class="grid gap-4 py-4 px-8">
									<div
										v-for="(condition, key) in conditions[
											$page.props.auth.user.role
										]"
										:key="key"
										:class="{ 'border-t pt-4': key != 1 }"
									>
										<label class="inline-flex items-start">
											<input
												name="conditions[]"
												type="checkbox"
												class="form-checkbox border rounded w-5 h-5 mt-1"
												:value="key"
												v-model="form.conditions"
											/>
											<p class="mr-2 leading-loose">
												<span class="text-lg font-bold"
													>{{ key }}.</span
												>
												{{ condition }}
											</p>
										</label>
									</div>
								</div>
								<div
									class="py-4 px-8 flex justify-between bg-gray-50"
								>
									<div>
										<InputError
											:message="form.errors.conditions"
										/>
									</div>
									<Button
										:class="{
											'opacity-25': form.processing,
										}"
										:disabled="form.processing"
									>
										تأكيد
									</Button>
								</div>
							</form>
						</div>
					</div>
				</transition>
			</div>
		</div>
	</div>
</template>

<script>
import { useForm } from "@inertiajs/inertia-vue3";

import Button from "@/UI/Button";
import InputError from "@/UI/InputError";
import Link from "../UI/Link.vue";

export default {
	components: { Button, InputError, Link },

	setup() {
		const form = useForm({
			conditions: [],
		});

		const conditions = {
			client: {
				1: "عند إجراء طلب ولضمان حق مقدم الخدمة سيتم خصم قيمة الخدمة المقدمة مقدما من حسابك البنكي حتى يقوم مقدم الخدمة بتقديم خدمته اليك وإن حصل بخلاف ذلك سيتم إرجاء كامل المبلغ إليك.",
				2: "اقر وألتزم بتوفير شرح مفصل عن خدمتي التي أريدها ويحق لمقدم الخدمة ان يأخذ فرق السعر ان كانت الخدمة مطلوبة بخلاف الخدمة الموصوفة.",
				3: "إذا تلقت إدارة الموقع 5 إنذارات سيئة عني من خلال مقدمين الخدمة يحق لها حذف حسابي دون سابق إنذار وربما إستدعائي لتعويض مقدمين الخدمة.",
				4: "المسافة التي يقطعها مقدموا الخدمة للوصول إليك مقدر بينكما وليس للموقع أي شأن بذلك بالنسبة لعمال التحميل والتنزيل ومعلمين الفك والتركيب.",
				5: "تبدأ خدمة مقدم الخدمة بالنسبة لسائقين النقل فور وصلهم إليك وليس قبل ذلك ويجب ان انتبه لذلك عند طلب خدمة",
				6: "سيتم خصم مبلغ 5 ريالات سعودية من حسابك البنكي فور تسجيلك وسيتم ارجاعها في غضون 24 ساعة للأسباب التالية: التأكد من سلامة الحساب وأنه ليس روبوتا، التأكد من سلامة البطاقة البنكية",
			},
			company: {
				1: "سيتم ايصال الاشعارات إليك فور خصم مستحقات الموقع من حسابكم البنكي.",
				2: "أقر وألتزم بأن جميع البيانات الواردة سابقا صحيحة بنسبة 100% وأن أي تعارض فيها سيعرضني إلى عقوبة شطب حسابي دون سابق إنذار مع خصم المبلغ المترتب",
				3: " اقر وألتزم بتوفير أعلى جودة ممكنة في مجال خدمتي وأن أتميز على قدر استطاعتي في مجال عملي.",
				4: "يجب الانتباه ان الى ان تفاصيل الطلبات التي تصل إليك يتحمل مسؤليتها العميل وليس الموقع/الشركة/التطبيق ويحق لك ان تأخذ فرق السعر إذا كانت الخدمة المطلوبة بخلاف الخدمة الموصوفة أما الموقع فملزم بتوصيل المبلغ الذي كتبه العميل في ن موذج الطلب فقط.",
				5: " يجب الانتباه إلى أن المسافة التي تقطعها للوصول لمقدم الطلب ليست داخل تكاليف الخدمة المقدمة إلا إذا كان في ذلك خدمة مقدم ة للعميل بشكل أو بأخر.",
				6: " إذا تلقت إدارة الموقع 5 إنذارات سيئة عني من خلال العملاء يحق لها حذف حسابي دون سابق إنذار وربما إستدعائي لتعويض العملاء.",
				7: " تغييري لمجال عملي يعني علي الانتضار حتى بداية الشهر القادم وخصم المبلغ المناسب وبعدها أتلقى الاشعارات المناسبة للمج ال الجديد المضاف.",
				8: "سيتم خصم مبلغ 5 ريالات سعودية من حسابك البنكي فور تسجيلك وسيتم ارجاعها في غضون 24 ساعة للأسباب التالية: التأكد من سلامة الحساب وأنه ليس روبوتا، التأكد من سلامة البطاقة البنكية",
				9: " لا يضمن الموقع لي مقدار دخل معين ولاكن ذلك يرجع الى مدى جدي وإجتهادي في العمل ولكن يتكفل بإصال جميع الاشعارات إلي بعدل وإنصاف.",
				10: " لم يأخذ الموقع البيانات التفصيلية للعمال لأنه يفترض أن المؤسسة الشركة تأمن عمالة سليمة قانونيا . لم يأخذ الموقع البيانات التفصيلية للمركبات لأنه يفترض أن المؤسسة الشركة تأمن مركبات سليمة قانونيا علما أن أدنى مودي ل للمركبات يجب ان تكون اعلى من 1999.",
			},
			worker: {
				1: "سيتم ايصال الاشعارات إليك فور خصم مستحقات الموقع من حسابك البنكي.",
				2: "يجب الانتباه ان الى ان تفاصيل الطلبات التي تصل إليك يتحمل مسؤليتها العميل وليس الموقع/الشركة/التطبيق ويحق لك ان تأخذ فرق السعر إذا كانت الخدمة المطلوبة بخلاف الخدمة الموصوفة أما الموقع فملزم بتوصيل المبلغ الذي كتبه العميل في نموذج الطلب فقط.",
				3: "يجب الانتباه إلى أن المسافة التي تقطعها للوصول لمقدم الطلب ليست داخل تكاليف الخدمة المقدمة إلا إذا كان في ذلك خدمة مقدمة للعميل بشكل أو بأخر.",
				4: "سيتم خصم مبلغ 5 ريالات سعودية من حسابك البنكي فور تسجيلك وسيتم ارجاعها في غضون 24 ساعة للأسباب التالية: التأكد من سلامة الحساب وأنه ليس روبوتا، التأكد من سلامة البطاقة البنكية",
				5: "تغييري لمجال عملي أو إضافة مهنة يعني علي الانتضار حتى بداية الشهر القادم وخصم المبلغ المناسب وبعدها أتلقى الاشعارات المناسبة للمجال الجديد المضاف علما ان قيمة االمجال الواحد 50 ريال كل 30 يوم والمجالين 100ريال كل 30 يوم وهكذا مالم اتلقى عرضا او خصما.",
				6: " إذا تلقت إدارة الموقع 5 إنذارات سيئة عني من خلال العملاء يحق لها حذف حسابي دون سابق إنذار وربما إستدعائي لتعويض العملاء.",
				7: " اقر وألتزم بتوفير أعلى جودة ممكنة في مجال خدمتي وأن أتميز على قدر استطاعتي في مجال عملي .",
				8: "أقر وألتزم بأن جميع البيانات الواردة سابقا صحيحة بنسبة 100% وأن أي تعارض فيها سيعرضني إلى عقوبة شطب حسابي دون سابق إنذار مع خصم المبلغ المترتب",
				9: "لا يضمن الموقع لي مقدار دخل معين ولاكن ذلك يرجع الى مدى جدي وإجتهادي في العمل ولكن يتكفل بإيصال جميع الاشعارات حسب منطقتي ومجال عملي أو حسب خيارات العميل.",
			},
		};

		const accept = () => {
			form.post(route("accept"), {
				preserveScroll: true,
			});
		};

		return { form, accept, conditions };
	},
};
</script>